SamuelNCarvalho/arduino-avr/boards.txt
ssmicro.name=SS Micro

ssmicro.upload.tool=avrdude
ssmicro.upload.protocol=avr109
ssmicro.upload.maximum_size=28672
ssmicro.upload.maximum_data_size=2560
ssmicro.upload.speed=57600
ssmicro.upload.disable_flushing=true
ssmicro.upload.use_1200bps_touch=true
ssmicro.upload.wait_for_upload_port=true

ssmicro.bootloader.tool=avrdude
ssmicro.bootloader.unlock_bits=0x3F
ssmicro.bootloader.lock_bits=0x2F
ssmicro.bootloader.low_fuses=0xFF
ssmicro.bootloader.high_fuses=0xD8

ssmicro.build.board=AVR_ATMEGA32U4
ssmicro.build.core=arduino
ssmicro.build.mcu=atmega32u4
ssmicro.build.variant=ssmicro

# CPU #
ssmicro.build.f_cpu=8000000L
ssmicro.bootloader.extended_fuses=0xFE
ssmicro.bootloader.file=caterina/Caterina-promicro8.hex

# Keyboard ID #
ssmicro.menu.keyboardid.default=Arduino Leonardo
ssmicro.menu.keyboardid.default.build.vid=0x2341
ssmicro.menu.keyboardid.default.build.pid=0x8036
ssmicro.menu.keyboardid.default.build.usb_product="Leonardo"
ssmicro.menu.keyboardid.default.build.usb_manufacturer="Arduino"

ssmicro.menu.keyboardid.apple=Apple Aluminium Keyboard
ssmicro.menu.keyboardid.apple.build.vid=0x05ac
ssmicro.menu.keyboardid.apple.build.pid=0x0221
ssmicro.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
ssmicro.menu.keyboardid.apple.build.usb_manufacturer="Apple"

ssmicro.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
ssmicro.menu.keyboardid.appleint.build.vid=0x05ac
ssmicro.menu.keyboardid.appleint.build.pid=0x0259
ssmicro.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
ssmicro.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

ssmicro.menu.keyboardid.logitechhid=Logitech USB Keyboard
ssmicro.menu.keyboardid.logitechhid.build.vid=0x046d
ssmicro.menu.keyboardid.logitechhid.build.pid=0xc316
ssmicro.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
ssmicro.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

ssmicro.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
ssmicro.menu.keyboardid.logitechgaming.build.vid=0x046d
ssmicro.menu.keyboardid.logitechgaming.build.pid=0xc335
ssmicro.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
ssmicro.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

ssmicro.menu.keyboardid.ms=Microsoft USB Keyboard
ssmicro.menu.keyboardid.ms.build.vid=0x045e
ssmicro.menu.keyboardid.ms.build.pid=0xfff8
ssmicro.menu.keyboardid.ms.build.usb_product="USB Keyboard"
ssmicro.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

# Protocol #
ssmicro.menu.protocol.auto=Auto (I2C & Serial)
ssmicro.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

ssmicro.menu.protocol.i2c=I2C
ssmicro.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

ssmicro.menu.protocol.serial=Serial
ssmicro.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

# Debug #
ssmicro.menu.debug.serial=Serial (115200b, newline)
ssmicro.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

ssmicro.menu.debug.disabled=Disabled
ssmicro.menu.debug.disabled.build.debug_flags=

# LED #
ssmicro.menu.ledpin.disabled=Disabled
ssmicro.menu.ledpin.0=D0 RX (Serial)
ssmicro.menu.ledpin.0.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=0
ssmicro.menu.ledpin.1=D1 TX (Serial)
ssmicro.menu.ledpin.1.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=1
ssmicro.menu.ledpin.2=D2 SDA (I2C)
ssmicro.menu.ledpin.2.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=2
ssmicro.menu.ledpin.3=D3 SCL (I2C)
ssmicro.menu.ledpin.3.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=3
ssmicro.menu.ledpin.6=D6 A8
ssmicro.menu.ledpin.6.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=6
ssmicro.menu.ledpin.9=D9 A10
ssmicro.menu.ledpin.9.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=9
ssmicro.menu.ledpin.10=D10 A11
ssmicro.menu.ledpin.10.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=10
ssmicro.menu.ledpin.11=D11
ssmicro.menu.ledpin.11.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=11
ssmicro.menu.ledpin.14=D14 MI (MISO SPI)
ssmicro.menu.ledpin.14.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=14
ssmicro.menu.ledpin.15=D15 SCK (SCLK SPI)
ssmicro.menu.ledpin.15.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=15
ssmicro.menu.ledpin.16=D16 MO (MOSI SPI)
ssmicro.menu.ledpin.16.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=16
ssmicro.menu.ledpin.18=A0
ssmicro.menu.ledpin.18.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=18
ssmicro.menu.ledpin.19=A1
ssmicro.menu.ledpin.19.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=19
ssmicro.menu.ledpin.20=A2
ssmicro.menu.ledpin.20.build.led_pin=-DNEOPIXEL -DNEOPIXEL_NUM=1 -DLED_PIN=20

# Serial Bridge #
ssmicro.menu.bridge.disabled=Disabled
ssmicro.menu.bridge.disabled.build.bridge_flags=

ssmicro.menu.bridge.serial1=Serial1
ssmicro.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

ssmicro.menu.bridgebutton.disabled=Disabled
ssmicro.menu.bridgebutton.2=D2 SDA (I2C)
ssmicro.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
ssmicro.menu.bridgebutton.3=D3 SCL (I2C)
ssmicro.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
ssmicro.menu.bridgebutton.6=D6 A8
ssmicro.menu.bridgebutton.6.build.bridge_button=-DBRIDGE_SWITCH=6
ssmicro.menu.bridgebutton.9=D9 A10
ssmicro.menu.bridgebutton.9.build.bridge_button=-DBRIDGE_SWITCH=9
ssmicro.menu.bridgebutton.10=D10 A11
ssmicro.menu.bridgebutton.10.build.bridge_button=-DBRIDGE_SWITCH=10
ssmicro.menu.bridgebutton.11=D11
ssmicro.menu.bridgebutton.11.build.bridge_button=-DBRIDGE_SWITCH=11
ssmicro.menu.bridgebutton.14=D14 MI (MISO SPI)
ssmicro.menu.bridgebutton.14.build.bridge_button=-DBRIDGE_SWITCH=14
ssmicro.menu.bridgebutton.15=D15 SCK (SCLK SPI)
ssmicro.menu.bridgebutton.15.build.bridge_button=-DBRIDGE_SWITCH=15
ssmicro.menu.bridgebutton.16=D16 MO (MOSI SPI)
ssmicro.menu.bridgebutton.16.build.bridge_button=-DBRIDGE_SWITCH=16
ssmicro.menu.bridgebutton.18=A0
ssmicro.menu.bridgebutton.18.build.bridge_button=-DBRIDGE_SWITCH=18
ssmicro.menu.bridgebutton.19=A1
ssmicro.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
ssmicro.menu.bridgebutton.20=A2
ssmicro.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20

ssmicro.menu.bridgerst.disabled=Disabled
ssmicro.menu.bridgerst.2=D2 SDA (I2C)
ssmicro.menu.bridgerst.2.build.bridge_rst=-DBRIDGE_RST=2
ssmicro.menu.bridgerst.3=D3 SCL (I2C)
ssmicro.menu.bridgerst.3.build.bridge_rst=-DBRIDGE_RST=3
ssmicro.menu.bridgerst.6=D6 A8
ssmicro.menu.bridgerst.6.build.bridge_rst=-DBRIDGE_RST=6
ssmicro.menu.bridgerst.9=D9 A10
ssmicro.menu.bridgerst.9.build.bridge_rst=-DBRIDGE_RST=9
ssmicro.menu.bridgerst.10=D10 A11
ssmicro.menu.bridgerst.10.build.bridge_rst=-DBRIDGE_RST=10
ssmicro.menu.bridgerst.11=D11
ssmicro.menu.bridgerst.11.build.bridge_rst=-DBRIDGE_RST=11
ssmicro.menu.bridgerst.14=D14 MI (MISO SPI)
ssmicro.menu.bridgerst.14.build.bridge_rst=-DBRIDGE_RST=14
ssmicro.menu.bridgerst.15=D15 SCK (SCLK SPI)
ssmicro.menu.bridgerst.15.build.bridge_rst=-DBRIDGE_RST=15
ssmicro.menu.bridgerst.16=D16 MO (MOSI SPI)
ssmicro.menu.bridgerst.16.build.bridge_rst=-DBRIDGE_RST=16
ssmicro.menu.bridgerst.18=A0
ssmicro.menu.bridgerst.18.build.bridge_rst=-DBRIDGE_RST=18
ssmicro.menu.bridgerst.19=A1
ssmicro.menu.bridgerst.19.build.bridge_rst=-DBRIDGE_RST=19
ssmicro.menu.bridgerst.20=A2
ssmicro.menu.bridgerst.20.build.bridge_rst=-DBRIDGE_RST=20

ssmicro.menu.bridge0.disabled=Disabled
ssmicro.menu.bridge0.2=D2 SDA (I2C)
ssmicro.menu.bridge0.2.build.bridge_0=-DBRIDGE_0=2
ssmicro.menu.bridge0.3=D3 SCL (I2C)
ssmicro.menu.bridge0.3.build.bridge_0=-DBRIDGE_0=3
ssmicro.menu.bridge0.6=D6 A8
ssmicro.menu.bridge0.6.build.bridge_0=-DBRIDGE_0=6
ssmicro.menu.bridge0.9=D9 A10
ssmicro.menu.bridge0.9.build.bridge_0=-DBRIDGE_0=9
ssmicro.menu.bridge0.10=D10 A11
ssmicro.menu.bridge0.10.build.bridge_0=-DBRIDGE_0=10
ssmicro.menu.bridge0.11=D11
ssmicro.menu.bridge0.11.build.bridge_0=-DBRIDGE_0=11
ssmicro.menu.bridge0.14=D14 MI (MISO SPI)
ssmicro.menu.bridge0.14.build.bridge_0=-DBRIDGE_0=14
ssmicro.menu.bridge0.15=D15 SCK (SCLK SPI)
ssmicro.menu.bridge0.15.build.bridge_0=-DBRIDGE_0=15
ssmicro.menu.bridge0.16=D16 MO (MOSI SPI)
ssmicro.menu.bridge0.16.build.bridge_0=-DBRIDGE_0=16
ssmicro.menu.bridge0.18=A0
ssmicro.menu.bridge0.18.build.bridge_0=-DBRIDGE_0=18
ssmicro.menu.bridge0.19=A1
ssmicro.menu.bridge0.19.build.bridge_0=-DBRIDGE_0=19
ssmicro.menu.bridge0.20=A2
ssmicro.menu.bridge0.20.build.bridge_0=-DBRIDGE_0=20

